<?php
/**
 * Created by PhpStorm.
 * User: Максим
 * Date: 11.01.2017
 * Time: 15:15
 */
echo "<html><head></head><body>";
echo "<h3>Тестовое задание 1</h3><br>";

$a=2;
echo "Значение первой переменной равно ", $a, "<br>";

$b=rand(1,100);
echo "Значение второй переменной случайное: ", $b, "<br>";

$rez=$a+$b;

echo "Сумма значений равна: ",$a,"+",$b,"=",$rez;

echo "<h3>Тестовое задание 2</h3>";
echo "<p>Четные числа от 1 до 10</p>";
for($i=1; $i<11; $i++){
    if ($i%2 == 0){
        echo $i,", ";
    }
}



"</body></html>";